9/data/attachments/4a8147a6986708df.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_dba243b4-fe2f-476f-b446-32680501db19</nif:username>
            <nif:friendToBeAdded>Christopher_development_Friend_2534_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>